TodosApp/app/controllers/api/todos_controller.rb

  def index
    render json: Todo.all
---
SELECT "todos".* FROM "todos"

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["body", "muffins"], ["done", false], ["created_at", "2021-03-08 19:54:36.830377"], ["updated_at", "2021-03-08 19:54:36.830377"]]

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
    render json: Todo.all
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 5]]
SELECT "todos".* FROM "todos"